exercise3/karmanVortex/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (0.4 0 0)
    (0.6 0 0)
    (1 0 0)
    (5 0 0)
    (0 0.4 0)
    (0.4 0.4 0)
    (0.6 0.4 0)
    (1 0.4 0)
    (5 0.4 0)
    (0 0.6 0)
    (0.4 0.6 0)
    (0.6 0.6 0)
    (1 0.6 0)
    (5 0.6 0)
    (0 1 0)
    (0.4 1 0)
    (0.6 1 0)
    (1 1 0)
    (5 1 0)

    (0 0 1)
    (0.4 0 1)
    (0.6 0 1)
    (1 0 1)
    (5 0 1)
    (0 0.4 1)
    (0.4 0.4 1)
    (0.6 0.4 1)
    (1 0.4 1)
    (5 0.4 1)
    (0 0.6 1)
    (0.4 0.6 1)
    (0.6 0.6 1)
    (1 0.6 1)
    (5 0.6 1)
    (0 1 1)
    (0.4 1 1)
    (0.6 1 1)
    (1 1 1)
    (5 1 1)
	
);

blocks
(
    hex (0 1 6 5 20 21 26 25) (24 24 1) simpleGrading (1 1 1)
    hex (1 2 7 6 21 22 27 26) (12 24 1) simpleGrading (1 1 1)
    hex (2 3 8 7 22 23 28 27) (24 24 1) simpleGrading (1 1 1)
    hex (3 4 9 8 23 24 29 28) (240 24 1) simpleGrading (1 1 1)
    hex (5 6 11 10 25 26 31 30) (24 12 1) simpleGrading (1 1 1)
    hex (7 8 13 12 27 28 33 32) (24 12 1) simpleGrading (1 1 1)
    hex (8 9 14 13 28 29 34 33) (240 12 1) simpleGrading (1 1 1)
    hex (10 11 16 15 30 31 36 35) (24 24 1) simpleGrading (1 1 1)
    hex (11 12 17 16 31 32 37 36) (12 24 1) simpleGrading (1 1 1)
    hex (12 13 18 17 32 33 38 37) (24 24 1) simpleGrading (1 1 1)
    hex (13 14 19 18 33 34 39 38) (240 24 1) simpleGrading (1 1 1)
);

edges
(
    arc 6 7 (0.5 0.35858 0)
    arc 26 27 (0.5 0.35858 1)
    arc 11 12 (0.5 0.64142 0)
    arc 31 32 (0.5 0.64142 1)
    arc 6 11 (0.35858 0.5 0)
    arc 26 31 (0.35858 0.5 1)
    arc 7 12 (0.64142 0.5 0)
    arc 27 32 (0.64142 0.5 1)
);

boundary
(
    inflowWall
    {
        type wall;
        faces
        (
            (0 5 20 25)
	    (5 10 25 30)
	    (10 15 30 35)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 20 21)
            (1 2 21 22)
            (2 3 22 23)
            (3 4 23 24)
            (15 16 35 36)
	    (16 17 36 37)
	    (17 18 37 38)
	    (18 19 38 39)
            (6 7 26 27)
	    (11 12 31 32)
	    (6 11 26 31)
	    (7 12 27 32)
       	);
    }

    outflowWall
    {
        type wall;
	faces
	(
	    (4 9 24 29)
	    (9 14 29 34)
	    (14 19 34 39)
	);
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 6 5)
	    (20 21 26 25)
	    (1 2 7 6)
            (21 22 27 26)
   	    (2 3 8 7)
	    (22 23 28 27)
            (3 4 9 8)
	    (23 24 29 28)
            (5 6 11 10)
	    (25 26 31 30)
            (7 8 13 12)
	    (27 28 33 32)
            (8 9 14 13)
	    (28 29 34 33)
            (10 11 16 15)
	    (30 31 36 35)
            (11 12 17 16)
	    (31 32 37 36)
            (12 13 18 17)
	    (32 33 38 37)
            (13 14 19 18)
	    (33 34 39 38)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
